app/Controllers/Home.php

SELECT *
FROM `produk`
SELECT *
FROM `profile`
---
    public function index()
    {
        $data['title'] = $this->title . "Beranda ";

        // Bagian Upload Produk
        $ProdukModel = new ProdukModel();
        $data['produks'] = $this->ProdukModel->findAll();
        $data['session'] = \Config\Services::session();

        // Bagian profile
        $ProfileModel = new ProfileModel();
        $data['Profile'] = $this->ProfileModel->findAll();