app/Models/SliderModel.php

    public function getTransactionsByCustomerIds($id)
    {
        // Gantikan 'nama_tabel' dengan nama tabel sesuai dengan struktur database Anda
        return $this->db->table('slider')->whereIn('id', $id)->get()->getResultArray();
---
SELECT *
FROM `slider`
WHERE `id` IN ('8')